mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
/****************************************************************************
 * drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * nRF7002 core driver: initialization sequence and FMAC event callbacks.
 *
 * Phase 3 additions:
 *   - rx_frm_callbk_fn: queues frames outside the FMAC callback
 *   - nrf7002_rx_worker: delivers received data frames from LPWORK
 *   - EAPOL worker: handles control-port frames from LPWORK so HPWORK can
 *     continue draining RPU events/TX_DONE
 *
 * Reference: NCS/modules/lib/nrf_wifi/fw_if/umac_if/
 *            drivers/wireless/ieee80211/bcm43xxx/bcmf_netdev.c
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <errno.h>
#include <string.h>
#include <syslog.h>

#include <net/if.h>
#include <netinet/in.h>
#include <nuttx/net/net.h>
#include <nuttx/net/netdev.h>
#include <nuttx/mutex.h>
#include <nuttx/semaphore.h>
#include <nuttx/wqueue.h>
#include <nuttx/kmalloc.h>
#include <nuttx/irq.h>
#include <nuttx/spinlock.h>

#include "osal_api.h"
#include "fmac_api.h"
#include "fmac_structs.h"
#include "host_rpu_umac_if.h"
#include "common/rpu_if.h"
#include "common/fmac_api_common.h"
#include "common/fmac_util.h"
#include "system/fmac_peer.h"

#include "nrf7002_osal.h"
#include "nrf7002_bus_qspi.h"
#include "nrf7002_driver.h"
#include "phy_rf_params_common.h"
#include "nrf7002_wpa.h"

/****************************************************************************
 * RPU Firmware Blob
 *
 * The nRF7002 RPU requires a firmware patch blob (nrf70.bin) to be
 * downloaded before nrf_wifi_sys_fmac_dev_init() can succeed.
 *
 * The blob is Nordic-proprietary (LicenseRef-Nordic-5-Clause) and is NOT
 * distributed in this repository.  It is supplied at build time from the
 * user's nRF Connect SDK installation: the driver references the firmware
 * via the symbols below, which are defined in a generated file
 * (nrf7002_fw_blob.c, produced by tools/gen_fw_blob.sh from nrf70.bin) that
 * is git-ignored.  See ncs/README.md for the generation step.
 ****************************************************************************/

extern const char g_nrf70_fw_patch[];
extern const unsigned int g_nrf70_fw_patch_len;

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Minimum RX buffer pool sizes - keep the count small to fit in 512 KB RAM.
 * NCS always expects MAX_NUM_OF_RX_QUEUES pools, and the packet-RAM layout
 * reserves NRF70_RX_NUM_BUFS * NRF70_RX_MAX_DATA_SIZE bytes for RX.
 */

#define NRF7002_RX_POOL0_COUNT              2
#define NRF7002_RX_POOL1_COUNT              1
#define NRF7002_RX_POOL2_COUNT              1
#define NRF7002_RX_BUF_SIZE                 NRF70_RX_MAX_DATA_SIZE

#define NRF7002_MAX_TX_AGGREGATION          9
#define NRF7002_MAX_TX_AGG_SESSIONS         4
#define NRF7002_MAX_RX_AGG_SESSIONS         8
#define NRF7002_MAX_PKT_RAM_TX_ALIGN_OVERHEAD 6
#define NRF7002_RX_REORDER_BUF_SIZE \
  (NRF70_RX_NUM_BUFS / MAX_NUM_OF_RX_QUEUES)

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Single global driver instance */

struct nrf7002_priv g_nrf7002_priv;

/* RX buffer pool configuration */

static struct rx_buf_pool_params g_rx_buf_pools[MAX_NUM_OF_RX_QUEUES] =
{
  {
    .num_bufs = NRF7002_RX_POOL0_COUNT,
    .buf_sz   = NRF7002_RX_BUF_SIZE,
  },
  {
    .num_bufs = NRF7002_RX_POOL1_COUNT,
    .buf_sz   = NRF7002_RX_BUF_SIZE,
  },
  {
    .num_bufs = NRF7002_RX_POOL2_COUNT,
    .buf_sz   = NRF7002_RX_BUF_SIZE,
  },
};

/* Data configuration: minimal TX/RX parameters */

static struct nrf_wifi_data_config_params g_data_config;

/****************************************************************************
 * Private Functions — RX LPWORK delivery
 ****************************************************************************/

/****************************************************************************
 * Name: nrf7002_rx_worker
 *
 * Description:
 *   Deliver one received frame to the NuttX network stack, then free the nbuf.
 *
 *   The nbuf pointer is passed directly as the work arg.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: nrf7002_rx_deliver_one
 *
 * Description:
 *   Deliver a single received frame to the NuttX network stack.
 *   Called with net_lock held; frees the nbuf before returning.
 *
 ****************************************************************************/

/* Called with net_lock held and with EAPOL already filtered out. */

static void nrf7002_rx_deliver_one(struct nrf7002_priv *priv,
                                   struct nrf7002_nbuf *nbuf)
{
  struct net_driver_s *dev = &priv->netdev;
  unsigned int         frame_len;
  uint16_t             ethertype;

