mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
  frame_len = (unsigned int)nbuf->len;

  if (frame_len == 0 || frame_len > CONFIG_NET_ETH_PKTSIZE)
    {
      syslog(LOG_WARNING,
             "nrf7002: rx: frame length %u out of range\n", frame_len);
      goto out_free;
    }

  if (!priv->carrier_up)
    {
      goto out_free;
    }

  dev->d_buf = nbuf->data;
  dev->d_len = frame_len;

#ifdef CONFIG_NET_PKT
  pkt_input(dev);
#endif

  if (frame_len >= 14)
    {
      ethertype = ((uint16_t)nbuf->data[12] << 8)
                | (uint16_t)nbuf->data[13];

#ifdef CONFIG_NET_IPv4
      if (ethertype == 0x0800)
        {
          NETDEV_RXIPV4(dev);
          ipv4_input(dev);
          if (dev->d_len > 0)
            {
              nrf7002_txpoll(dev);
            }
        }
      else
#endif
#ifdef CONFIG_NET_IPv6
      if (ethertype == 0x86dd)
        {
          NETDEV_RXIPV6(dev);
          ipv6_input(dev);
          if (dev->d_len > 0)
            {
              nrf7002_txpoll(dev);
            }
        }
      else
#endif
#ifdef CONFIG_NET_ARP
      if (ethertype == 0x0806)
        {
          NETDEV_RXARP(dev);
          arp_input(dev);
          if (dev->d_len > 0)
            {
              nrf7002_txpoll(dev);
            }
        }
      else
#endif
        {
          NETDEV_RXDROPPED(dev);
        }
    }

  dev->d_buf = priv->pktbuf;
  dev->d_len = 0;

out_free:
  nrf_wifi_osal_nbuf_free(nbuf);
}

/****************************************************************************
 * Name: nrf7002_rx_worker
 *
 * Description:
 *   LPWORK handler: drain the entire rx_queue, delivering each frame to
 *   the NuttX network stack.  Frames are chained via nbuf->next.
 *
 *   Using a queue instead of a single work-item argument prevents frame
 *   loss under high RX rates (e.g. TCP iperf) where rx_frm_cb fires faster
 *   than LPWORK can drain a single frame.
 *
 ****************************************************************************/

static void nrf7002_rx_worker(FAR void *arg)
{
  struct nrf7002_priv *priv = &g_nrf7002_priv;
  struct nrf7002_nbuf *nbuf;
  struct nrf7002_nbuf *next;
  irqstate_t           flags;

  (void)arg;

  /* Atomically steal the entire queue */

  flags = enter_critical_section();
  nbuf                 = priv->rx_queue_head;
  priv->rx_queue_head  = NULL;
  priv->rx_queue_tail  = NULL;
  leave_critical_section(flags);

  if (nbuf == NULL)
    {
      return;
    }

  while (nbuf != NULL)
    {
      next = (struct nrf7002_nbuf *)nbuf->next;
      nbuf->next = NULL;

      /* EAPOL frames are handled outside net_lock because WPA processing
       * may block (ADD_KEY semaphore waits).
       */

      if (nbuf->len >= 14 && priv->carrier_up &&
          nbuf->data[12] == 0x88 && nbuf->data[13] == 0x8e)
        {
          nrf7002_wpa_process_eapol(priv, nbuf->data, nbuf->len);
          nrf_wifi_osal_nbuf_free(nbuf);
        }
      else
        {
          net_lock();
          nrf7002_rx_deliver_one(priv, nbuf);
          net_unlock();
        }

      nbuf = next;
    }
}

/****************************************************************************
 * Name: nrf7002_eapol_worker
 *
 * Description:
 *   LPWORK handler that processes queued EAPOL (4-way handshake) frames.
 *   Runs after rx_frm_cb has returned and the NCS HAL lock_rx critical
 *   section has been released, so M2/M4 sent from process_eapol via
 *   start_xmit go out with the RPU TX path ready (no transient -1 failure).
 *
 ****************************************************************************/

static void nrf7002_eapol_worker(FAR void *arg)
{
  struct nrf7002_priv *priv = &g_nrf7002_priv;
  struct nrf7002_nbuf *nbuf;
  struct nrf7002_nbuf *next;
  irqstate_t           flags;
  bool                 resched;

  (void)arg;

  flags = enter_critical_section();
  nbuf                   = priv->eapol_queue_head;
  priv->eapol_queue_head = NULL;
  priv->eapol_queue_tail = NULL;
  leave_critical_section(flags);

  while (nbuf != NULL)
    {
      next       = (struct nrf7002_nbuf *)nbuf->next;
      nbuf->next = NULL;

      if (priv->carrier_up)
        {
          nrf7002_wpa_process_eapol(priv, nbuf->data, nbuf->len);
        }

      nrf_wifi_osal_nbuf_free(nbuf);
      nbuf = next;
    }

  flags = enter_critical_section();
  resched = priv->eapol_queue_head != NULL;
  leave_critical_section(flags);

  if (resched)
    {
      work_queue(LPWORK, &priv->eapol_work, nrf7002_eapol_worker, NULL, 0);
    }
}

/****************************************************************************
 * Private Functions — FMAC callbacks
 *
 * These are called by the NCS FMAC layer on WiFi events.
 ****************************************************************************/

/****************************************************************************
 * Name: nrf7002_scan_done_cb
 *
 * Description:
 *   Called when an RPU scan has completed.  Posts g_nrf7002_priv.scan_sem
 *   so nrf7002_ioctl can return the result to the caller.
 ****************************************************************************/

static void nrf7002_scan_done_cb(
  void *os_vif_ctx,
  struct nrf_wifi_umac_event_trigger_scan *scan_done_event,
  unsigned int event_len)
{
  struct nrf7002_priv    *priv = os_vif_ctx;
  enum nrf_wifi_status    status;

  (void)scan_done_event;
  (void)event_len;

  syslog(LOG_ERR, "nrf7002: SCAN_DONE from RPU, requesting display results\n");

  if (priv == NULL)
    {
      return;
    }

  /* The RPU has finished scanning.  Now send GET_SCAN_RESULTS with
   * SCAN_DISPLAY so the RPU will send NRF_WIFI_UMAC_EVENT_SCAN_DISPLAY_RESULT
   * events (one batch per AP found).  The semaphore is posted by
   * nrf7002_disp_scan_res_cb when it receives the last batch (more_res=false).
   *
   * If there are zero APs, the RPU sends a single SCAN_DISPLAY_RESULT with
   * event_bss_count=0 and seq=0 (more_res=false), which still triggers the
   * semaphore post.
   */

  /* For SCAN_CONNECT: the RPU has already populated its internal BSS
   * database during the active probe scan.  Calling GET_SCAN_RESULTS with
   * SCAN_CONNECT reason causes the RPU to flush those entries before auth,
   * resulting in cmd_status=-2 (ENOENT) when auth is sent.
   * Skip GET_SCAN_RESULTS for SCAN_CONNECT and post the semaphore directly
   * so nrf7002_ioctl_connect can proceed to auth immediately.
   *
   * For SCAN_DISPLAY: call GET_SCAN_RESULTS with SCAN_DISPLAY so the RPU
   * sends NRF_WIFI_UMAC_EVENT_SCAN_DISPLAY_RESULT events (one batch per AP).
   * The semaphore is posted by nrf7002_disp_scan_res_cb (more_res=false).
   */

