mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
  if (priv->scan_reason == SCAN_CONNECT)
    {
      /* scan_done_event == NULL: CMD_STATUS EBUSY from the RPU */

      if (scan_done_event == NULL)
        {
          syslog(LOG_INFO, "nrf7002: SCAN_CONNECT EBUSY — retry queued\n");
          priv->scan_done = false;
          priv->state     = NRF7002_STATE_IDLE;
          nxsem_post(&priv->scan_sem);
          return;
        }
    }

  /* Zephyr's nrf_wifi_wpa_supp_scan_results_get() always calls
   * GET_SCAN_RESULTS with SCAN_CONNECT reason — even after a SCAN_DISPLAY
   * trigger scan.  This returns NRF_WIFI_UMAC_EVENT_SCAN_RESULT events
   * with full BSS data (capability, beacon_interval, tsf, signal, IEs)
   * via scan_res_cb.  These BSS entries remain in the RPU's internal
   * database and are used by CMD_AUTHENTICATE.
   * Using SCAN_DISPLAY for GET_SCAN_RESULTS returns only summarized
   * display data without tsf and with potentially missing fields.
   */

  /* Use the same scan_reason that triggered this scan so that
   * SCAN_DISPLAY uses SCAN_DISPLAY (returns display results via
   * disp_scan_res_cb) and SCAN_CONNECT uses SCAN_CONNECT (returns
   * full BSS entries via scan_res_cb without consuming the database).
   */

  syslog(LOG_INFO, "nrf7002: SCAN_DONE — calling GET_SCAN_RESULTS(reason=%d)\n",
         priv->scan_reason);

  status = nrf_wifi_sys_fmac_scan_res_get(priv->fmac_dev_ctx,
                                           priv->vif_idx,
                                           priv->scan_reason);
  if (status != NRF_WIFI_STATUS_SUCCESS)
    {
      syslog(LOG_ERR, "nrf7002: fmac_scan_res_get failed: %d\n", status);

      /* Fall back: post semaphore so scan doesn't hang */

      priv->scan_done = true;
      priv->state     = NRF7002_STATE_IDLE;
      nxsem_post(&priv->scan_sem);
    }
  else
    {
      syslog(LOG_ERR, "nrf7002: GET_SCAN_RESULTS sent (reason=%d), waiting\n",
             priv->scan_reason);
    }
}

/****************************************************************************
 * Name: nrf7002_scan_res_cb
 *
 * Description:
 *   Called once per scan result by the FMAC.
 *   Extracts SSID, BSSID, RSSI and frequency and caches the result in
 *   priv->scan_results[].
 ****************************************************************************/

static void nrf7002_scan_res_cb(
  void *os_vif_ctx,
  struct nrf_wifi_umac_event_new_scan_results *scan_res,
  unsigned int event_len,
  bool more_res)
{
  struct nrf7002_priv       *priv = os_vif_ctx;
  struct nrf7002_scan_result *entry;
  const unsigned char        *ies;
  unsigned int                ies_len;
  unsigned int                ie_off;
  unsigned char               ie_id;
  unsigned char               ie_len;

  (void)event_len;

  if (priv == NULL || scan_res == NULL)
    {
      return;
    }

  if (priv->scan_count >= NRF7002_MAX_SCAN_RESULTS)
    {
      syslog(LOG_WARNING, "nrf7002: scan result table full, dropping\n");
      return;
    }

  syslog(LOG_ERR, "nrf7002: scan_res_cb valid_fields=0x%08x mac=%02x:%02x:%02x:%02x:%02x:%02x "
         "freq=%u rssi=%d ies_len=%u\n",
         scan_res->valid_fields,
         scan_res->mac_addr[0], scan_res->mac_addr[1], scan_res->mac_addr[2],
         scan_res->mac_addr[3], scan_res->mac_addr[4], scan_res->mac_addr[5],
         scan_res->frequency,
         (int)(scan_res->signal.signal.mbm_signal / 100),
         scan_res->ies_len);

  entry = &priv->scan_results[priv->scan_count];
  memset(entry, 0, sizeof(*entry));

  /* BSSID */

  memcpy(entry->bssid, scan_res->mac_addr, NRF7002_MAC_ADDR_LEN);

  /* Frequency */

  entry->frequency = scan_res->frequency;

  /* 802.11 capability, beacon interval and TSF — needed for auth command */

  if (scan_res->valid_fields &
      NRF_WIFI_EVENT_NEW_SCAN_RESULTS_BEACON_INTERVAL_VALID)
    {
      entry->beacon_interval = scan_res->beacon_interval;
    }

  entry->capability = scan_res->capability;
  entry->tsf        = scan_res->ies_tsf; /* TSF from probe response */

  /* RSSI: signal.mbm_signal is in mBm (100 * dBm); convert to dBm */

  if (scan_res->valid_fields &
      NRF_WIFI_EVENT_NEW_SCAN_RESULTS_SIGNAL_VALID)
    {
      entry->rssi     = (int16_t)(scan_res->signal.signal.mbm_signal / 100);
      entry->rssi_mbm = (int32_t)scan_res->signal.signal.mbm_signal;
    }
  else
    {
      entry->rssi     = -127; /* Unknown */
      entry->rssi_mbm = -12700; /* Unknown (-127 dBm in mBm) */
    }

  /* SSID: parse from Information Elements (tag 0 = SSID) */

  ies     = scan_res->ies;
  ies_len = scan_res->ies_len;
  ie_off  = 0;

  while (ie_off + 2 <= ies_len)
    {
      ie_id  = ies[ie_off];
      ie_len = ies[ie_off + 1];

      if (ie_off + 2 + ie_len > ies_len)
        {
          break;
        }

      if (ie_id == 0) /* SSID IE */
        {
          unsigned char ssid_len = ie_len > NRF7002_MAX_SSID_LEN
                                   ? NRF7002_MAX_SSID_LEN : ie_len;
          memcpy(entry->ssid, &ies[ie_off + 2], ssid_len);
          entry->ssid[ssid_len] = '\0';
          entry->ssid_len       = ssid_len;
          break;
        }

      ie_off += 2 + ie_len;
    }

  /* Minimal security classification based on capability (WPA/RSN IE)
   * A full parser would look for IE tag 48 (RSN) or tag 221 (WPA1).
   * For now mark as WPA2 if RSN IE (tag 48) is present.
   */

  entry->security = NRF7002_SECURITY_OPEN;
  ie_off          = 0;
  while (ie_off + 2 <= ies_len)
    {
      ie_id  = ies[ie_off];
      ie_len = ies[ie_off + 1];

      if (ie_off + 2 + ie_len > ies_len)
        {
          break;
        }

      if (ie_id == 48) /* RSN — WPA2 */
        {
          entry->security = NRF7002_SECURITY_WPA2;
          break;
        }

      ie_off += 2 + ie_len;
    }

  syslog(LOG_DEBUG, "nrf7002: scan[%d] ssid='%s' bssid=%02x:%02x:%02x:%02x:%02x:%02x "
         "rssi=%d freq=%lu sec=%d more=%d\n",
         priv->scan_count,
         entry->ssid,
         entry->bssid[0], entry->bssid[1], entry->bssid[2],
         entry->bssid[3], entry->bssid[4], entry->bssid[5],
         entry->rssi, entry->frequency, entry->security, (int)more_res);

  priv->scan_count++;

