mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
  /* For SCAN_CONNECT scans, the RPU delivers results via 0x101 events.
   * When more_res=false this is the last result — post scan_sem so that
   * nrf7002_ioctl_connect (which is waiting) can proceed to send auth.
   */

  if (!more_res)
    {
      syslog(LOG_INFO, "nrf7002: scan_res_cb complete: %d BSS entries\n",
             priv->scan_count);
      priv->scan_done = true;
      priv->state     = NRF7002_STATE_IDLE;
      nxsem_post(&priv->scan_sem);
    }
}

/****************************************************************************
 * Name: nrf7002_disp_scan_res_cb
 *
 * Description:
 *   Called for each AP found during a SCAN_DISPLAY scan.
 *   The RPU sends batches of up to DISPLAY_BSS_TOHOST_PEREVNT (8) results.
 *   Extract SSID, BSSID, channel and RSSI and cache in scan_results[].
 ****************************************************************************/

static void nrf7002_disp_scan_res_cb(
  void *os_vif_ctx,
  struct nrf_wifi_umac_event_new_scan_display_results *scan_res,
  unsigned int event_len,
  bool more_res)
{
  struct nrf7002_priv *priv = os_vif_ctx;
  struct nrf7002_scan_result *entry;
  unsigned char               count;
  unsigned char               i;

  (void)event_len;

  syslog(LOG_ERR, "nrf7002: disp_scan_res_cb more_res=%d\n", (int)more_res);

  if (priv == NULL || scan_res == NULL)
    {
      return;
    }

  count = scan_res->event_bss_count;
  syslog(LOG_ERR, "nrf7002: disp_scan_res_cb bss_count=%d\n", (int)count);
  if (count > 8)
    {
      count = 8;  /* DISPLAY_BSS_TOHOST_PEREVNT */
    }

  for (i = 0; i < count; i++)
    {
      struct umac_display_results *r = &scan_res->display_results[i];

      if (priv->scan_count >= NRF7002_MAX_SCAN_RESULTS)
        {
          syslog(LOG_WARNING, "nrf7002: scan result table full, dropping\n");
          break;
        }

      entry = &priv->scan_results[priv->scan_count];
      memset(entry, 0, sizeof(*entry));

      /* BSSID */

      memcpy(entry->bssid, r->mac_addr, NRF7002_MAC_ADDR_LEN);

      /* SSID */

      if (r->ssid.nrf_wifi_ssid_len > 0 &&
          r->ssid.nrf_wifi_ssid_len <= NRF7002_MAX_SSID_LEN)
        {
          memcpy(entry->ssid, r->ssid.nrf_wifi_ssid,
                 r->ssid.nrf_wifi_ssid_len);
          entry->ssid[r->ssid.nrf_wifi_ssid_len] = '\0';
          entry->ssid_len = r->ssid.nrf_wifi_ssid_len;
        }

      /* Frequency from channel number (2.4 GHz: ch1=2412, ch13=2472) */

      if (r->nwk_channel >= 1 && r->nwk_channel <= 13)
        {
          entry->frequency = 2412 + (r->nwk_channel - 1) * 5;
        }
      else if (r->nwk_channel == 14)
        {
          entry->frequency = 2484;
        }
      else if (r->nwk_channel >= 36)
        {
          /* 5 GHz: channel to MHz */

          entry->frequency = 5180 + (r->nwk_channel - 36) * 5;
        }

      /* RSSI: signal_type=2 (MBM) → mbm_signal/100 gives dBm
       *       signal_type=3 (UNSPEC) → unspec_signal is raw dBm (uint8)
       */

      if (r->signal.signal_type == NRF_WIFI_SIGNAL_TYPE_MBM)
        {
          entry->rssi = (int16_t)((int)r->signal.signal.mbm_signal / 100);
        }
      else if (r->signal.signal_type == NRF_WIFI_SIGNAL_TYPE_UNSPEC)
        {
          entry->rssi = (int16_t)r->signal.signal.unspec_signal;
        }
      else
        {
          entry->rssi = 0;
        }

      /* Security: 0=OPEN, anything else=WPA/WPA2 */

      entry->security = (r->security_type == 0) ? NRF7002_SECURITY_OPEN
                                                 : NRF7002_SECURITY_WPA2;

      /* 802.11 capability field and beacon interval (for auth command) */

      entry->capability      = r->capability;
      entry->beacon_interval = r->beacon_interval;

      syslog(LOG_ERR, "nrf7002: disp_scan[%d] ssid='%s' "
             "bssid=%02x:%02x:%02x:%02x:%02x:%02x "
             "ch=%u rssi=%d sigtype=%u sig_raw=%u sec=%d cap=0x%04x bi=%u\n",
             priv->scan_count,
             entry->ssid,
             entry->bssid[0], entry->bssid[1], entry->bssid[2],
             entry->bssid[3], entry->bssid[4], entry->bssid[5],
             r->nwk_channel, entry->rssi,
             r->signal.signal_type, r->signal.signal.mbm_signal,
             entry->security,
             entry->capability, entry->beacon_interval);

      priv->scan_count++;
    }

  /* If this is the last batch (more_res=false), scan is complete */

  if (!more_res)
    {
      syslog(LOG_ERR, "nrf7002: scan complete: %d APs found\n",
             priv->scan_count);
      priv->scan_done = true;
      priv->state     = NRF7002_STATE_IDLE;
      nxsem_post(&priv->scan_sem);
    }
}

/****************************************************************************
 * Name: nrf7002_process_rssi_cb
 *
 * Description:
 *   Called by the FMAC for every received data frame to update the RSSI.
 *   The FMAC always calls this — it does not NULL-check the pointer.
 ****************************************************************************/

static void nrf7002_process_rssi_cb(void *os_vif_ctx, signed short signal)
{
  struct nrf7002_priv *priv = os_vif_ctx;

  if (priv != NULL)
    {
      priv->last_rssi = signal;
    }
}

/****************************************************************************
 * Name: nrf7002_if_carr_state_chg_cb
 *
 * Description:
 *   Called when the link state changes (carrier on/off).
 *   Translates to netdev_carrier_on() / netdev_carrier_off().
 ****************************************************************************/

static enum nrf_wifi_status nrf7002_if_carr_state_chg_cb(
  void *os_vif_ctx,
  enum nrf_wifi_fmac_if_carr_state cs)
{
  struct nrf7002_priv *priv = os_vif_ctx;

  if (priv == NULL)
    {
      return NRF_WIFI_STATUS_FAIL;
    }

  if (cs == NRF_WIFI_FMAC_IF_CARR_STATE_ON)
    {
      syslog(LOG_INFO, "nrf7002: carrier ON\n");
      priv->carrier_up = true;
      priv->state      = NRF7002_STATE_ASSOCIATED;
      netdev_carrier_on(&priv->netdev);
    }
  else
    {
      /* Suppress carrier OFF while already associated.
       * PTK/GTK key refresh (second 4-way handshake) causes the RPU to
       * fire a transient carrier-OFF event during key installation.
       * If we forward it, arp_cleanup() wipes the ARP table and IFF_RUNNING
       * is cleared — the next frame fails with ENETUNREACH even though the
       * AP link is still up.  Real disconnects are handled by deauth_cb /
       * disassoc_cb which explicitly call netdev_carrier_off().
       */
      if (priv->state == NRF7002_STATE_ASSOCIATED)
        {
          syslog(LOG_INFO, "nrf7002: carrier OFF suppressed (key refresh)\n");
        }
      else
        {
          syslog(LOG_INFO, "nrf7002: carrier OFF\n");
          priv->carrier_up = false;
          priv->keys_installed = 0;
          priv->state      = NRF7002_STATE_IDLE;
          netdev_carrier_off(&priv->netdev);
        }
    }

  return NRF_WIFI_STATUS_SUCCESS;
}

/****************************************************************************
 * Name: nrf7002_auth_resp_cb
 *
 * Description:
 *   Called by FMAC when an authentication response frame is received from
 *   the AP.  The 802.11 auth frame body starts at byte 24 (after the fixed
 *   management header):
 *     [0-1] Algorithm
 *     [2-3] Sequence number
 *     [4-5] Status code  (0 = success)
 *
 *   We only log the result; the actual carrier-up happens in assoc_resp_cb.
 *
 ****************************************************************************/

static void nrf7002_auth_resp_cb(FAR void *os_vif_ctx,
                                 FAR struct nrf_wifi_umac_event_mlme *event,
                                 unsigned int event_len)
{
  FAR struct nrf7002_priv *priv = os_vif_ctx;
  uint16_t status = 0xffff;

  (void)event_len;

