mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
  /* 802.11 management header = 24 bytes; auth body byte offsets 4-5 = status */

  if (event && event->frame.frame_len >= 24 + 6)
    {
      const unsigned char *body =
        (const unsigned char *)event->frame.frame + 24;
      status = (uint16_t)body[4] | ((uint16_t)body[5] << 8);
    }

  if (status != 0)
    {
      syslog(LOG_WARNING, "nrf7002: auth FAILED status=%u\n", status);
      if (priv)
        {
          priv->state       = NRF7002_STATE_IDLE;
          priv->auth_failed = true;
          nxsem_post(&priv->auth_sem);
        }
      return;
    }

  syslog(LOG_INFO, "nrf7002: auth OK - sending assoc\n");

  if (priv == NULL || priv->state != NRF7002_STATE_AUTHENTICATING)
    {
      syslog(LOG_WARNING, "nrf7002: auth_resp_cb: unexpected state\n");
      return;
    }

  /* Post auth_sem to wake the LPWORK connect thread.  That thread will
   * build and send fmac_assoc from its own stack, avoiding the ~500-byte
   * stack-allocated assoc_info in a shallow HPWORK callback.
   */

  priv->auth_failed = false;
  priv->state       = NRF7002_STATE_AUTHENTICATING; /* keep; thread advances */
  nxsem_post(&priv->auth_sem);
}

/****************************************************************************
 * Name: nrf7002_assoc_resp_cb
 *
 * Description:
 *   Called by FMAC when an association response frame is received.  The
 *   802.11 assoc-resp body starts at byte 24:
 *     [0-1] Capabilities
 *     [2-3] Status code  (0 = success)
 *     [4-5] Association ID
 *
 *   On success (status == 0) we signal carrier-on, which completes the
 *   connection and wakes up any waiting ifup/DHCP.
 *
 ****************************************************************************/

static void nrf7002_assoc_resp_cb(FAR void *os_vif_ctx,
                                  FAR struct nrf_wifi_umac_event_mlme *event,
                                  unsigned int event_len)
{
  FAR struct nrf7002_priv *priv = os_vif_ctx;
  uint16_t status = 0xffff;

  (void)event_len;

  if (priv == NULL)
    {
      return;
    }

  /* 802.11 management header = 24 bytes; assoc-resp body byte offsets 2-3 = status */

  if (event && event->frame.frame_len >= 24 + 6)
    {
      const unsigned char *body =
        (const unsigned char *)event->frame.frame + 24;
      status = (uint16_t)body[2] | ((uint16_t)body[3] << 8);
    }

  if (status == 0)
    {
      int peer_id;
      struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx;

      syslog(LOG_INFO, "nrf7002: assoc OK - carrier ON\n");
      priv->keys_installed =
        (priv->security_type == NRF7002_SECURITY_WPA2) ? 0 : 1;

      /* Register the AP as a host-side FMAC TX peer. */

      peer_id = nrf_wifi_fmac_peer_get_id(priv->fmac_dev_ctx,
                                           priv->target_bssid);
      if (peer_id == -1)
        {
          peer_id = nrf_wifi_fmac_peer_add(priv->fmac_dev_ctx,
                                            priv->vif_idx,
                                            priv->target_bssid,
                                            0 /* is_legacy */,
                                            0 /* qos_supported */);
          if (peer_id >= 0)
            {
              syslog(LOG_INFO, "nrf7002: AP registered as peer %d\n",
                     peer_id);
            }
          else
            {
              syslog(LOG_ERR, "nrf7002: peer_add failed!\n");
            }
        }
      else
        {
          syslog(LOG_INFO, "nrf7002: AP already registered as peer %d\n",
                 peer_id);
        }

      /* NOTE: We previously sent SET_STATION(ASSOCIATED) here to mark the RPU
       * station associated before M2.  The RPU REJECTED it with
       * cmd_status=-22 (EINVAL) — for a STA VIF the association state is owned
       * by the AUTHENTICATE/ASSOCIATE flow, and an extra host SET_STATION is
       * invalid and appears to corrupt the RPU TX state (TX descriptors get
       * mapped but never produce TX_BUFF_DONE).  Removed.
       */

      sys_dev_ctx = wifi_dev_priv(priv->fmac_dev_ctx);
      if (sys_dev_ctx != NULL && peer_id >= 0 && peer_id < MAX_PEERS)
        {
          bool authorized = priv->security_type != NRF7002_SECURITY_WPA2;

          sys_dev_ctx->tx_config.peers[peer_id].authorized = authorized;
          priv->keys_installed = authorized ? 1 : 0;
        }

      priv->carrier_up   = true;
      priv->state        = NRF7002_STATE_ASSOCIATED;
      priv->assoc_failed = false;
      netdev_carrier_on(&priv->netdev);
      nxsem_post(&priv->assoc_sem);
    }
  else
    {
      syslog(LOG_WARNING, "nrf7002: assoc FAILED status=%u\n", status);
      priv->state        = NRF7002_STATE_IDLE;
      priv->assoc_failed = true;
      nxsem_post(&priv->assoc_sem);
    }
}

/****************************************************************************
 * Name: nrf7002_rx_frm_cb
 *
 * Description:
 *   Called by the FMAC when a received Ethernet frame is ready.
 *
 *   Phase 3 optimization: instead of delivering inline (which runs in
 *   whatever context the FMAC interrupt handler uses), we schedule
 *   nrf7002_rx_worker on HPWORK to deliver the frame asynchronously at
 *   high priority.  This reduces interrupt latency in the FMAC path.
 *
 *   The nbuf ownership is transferred to the work item; it will be freed
 *   by nrf7002_rx_worker after delivery.
 *
 ****************************************************************************/

static void nrf7002_rx_frm_cb(void *os_vif_ctx, void *frm)
{
  struct nrf7002_priv *priv = os_vif_ctx;
  struct nrf7002_nbuf *nbuf = (struct nrf7002_nbuf *)frm;
  irqstate_t           flags;

  if (priv == NULL || nbuf == NULL)
    {
      if (nbuf != NULL)
        {
          nrf_wifi_osal_nbuf_free(nbuf);
        }

      return;
    }

  /* EAPOL (4-way handshake) frames: queue + defer to nrf7002_eapol_worker.
   *
   * rx_frm_cb runs inside the NCS HAL lock_rx critical section (see
   * nrf_wifi_fmac_rx_event_process), with the RX descriptor not yet returned.
   * Sending M2/M4 from here (process_eapol -> start_xmit) makes the FMAC TX
   * path fail transiently (start_xmit returns -1), so the AP never receives
   * M2/M4 and disconnects right after EAPOL-4WAY-HS-COMPLETED.  Defer EAPOL
   * processing to a dedicated LPWORK item that runs once lock_rx is released.
   * Keeping EAPOL start_xmit off HPWORK leaves the RPU event bottom half free
   * to deliver TX_DONE and unmap TX descriptors before M1/M3 retries reuse
   * the same BE descriptor slot.
   */

  if (nbuf->len >= 14 && priv->carrier_up &&
      nbuf->data[12] == 0x88 && nbuf->data[13] == 0x8e)
    {
      nbuf->next = NULL;

      flags = enter_critical_section();
      if (priv->eapol_queue_tail != NULL)
        {
          priv->eapol_queue_tail->next = nbuf;
        }
      else
        {
          priv->eapol_queue_head = nbuf;
        }

      priv->eapol_queue_tail = nbuf;
      leave_critical_section(flags);

      work_queue(LPWORK, &priv->eapol_work, nrf7002_eapol_worker, NULL, 0);
      return;
    }

