mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
  /* Enqueue the frame onto the RX queue.
   *
   * The queue is protected by a critical section (interrupt disable) so
   * this is safe to call from any context the FMAC uses (including from
   * within the QSPI interrupt handler).
   *
   * We then (re-)schedule rx_worker on HPWORK.  If a work item is already
   * pending, work_queue returns -EALREADY / -EBUSY and we ignore it — the
   * already-queued rx_worker will drain the frame we just enqueued.
   */

  nbuf->next = NULL;

  flags = enter_critical_section();
  if (priv->rx_queue_tail != NULL)
    {
      priv->rx_queue_tail->next = nbuf;
    }
  else
    {
      priv->rx_queue_head = nbuf;
    }

  priv->rx_queue_tail = nbuf;
  leave_critical_section(flags);

  /* Schedule the data-frame worker on LPWORK.
   *
   * RX delivery (deep ipv4_input→TCP→txpoll chain) and TX poll both run on
   * LPWORK, separate from HPWORK which services the RPU HOSTIRQ bottom-half
   * and NCS HAL event/TX-done tasklets.  Keeping the FMAC-touching TX path
   * off HPWORK prevents the "start_xmit waits for an RPU response that only
   * HPWORK can deliver" deadlock.  Both share the LPWORK thread so dev->d_buf
   * has one owner.  The NCS tx_lock mutex is taken from both LPWORK (txpoll)
   * and HPWORK (TX-done in the event tasklet); CONFIG_PRIORITY_INHERITANCE
   * must be enabled so the LPWORK holder is boosted and HPWORK does not
   * block indefinitely (priority inversion).
   */

  work_queue(LPWORK, &priv->rx_work, nrf7002_rx_worker, NULL, 0);
}

/****************************************************************************
 * Name: g_nrf7002_callbk_fns
 *
 * Description:
 *   Minimum callback set required by nrf_wifi_sys_fmac_init.
 *   Callbacks not needed are left NULL.
 ****************************************************************************/

/****************************************************************************
 * Name: nrf7002_deauth_cb / nrf7002_disassoc_cb
 *
 * Description:
 *   Called when the AP sends a Deauthentication or Disassociation frame.
 *   Update local state so the driver knows the link is down.
 *
 ****************************************************************************/

static void nrf7002_deauth_cb(void *os_vif_ctx,
                               struct nrf_wifi_umac_event_mlme *event,
                               unsigned int event_len)
{
  struct nrf7002_priv *priv = os_vif_ctx;

  (void)event;
  (void)event_len;

  if (priv == NULL)
    {
      return;
    }

  syslog(LOG_WARNING, "nrf7002: deauth from AP — carrier OFF\n");

  priv->carrier_up = false;
  priv->keys_installed = 0;
  priv->state      = NRF7002_STATE_IDLE;
  netdev_carrier_off(&priv->netdev);
}

static void nrf7002_disassoc_cb(void *os_vif_ctx,
                                 struct nrf_wifi_umac_event_mlme *event,
                                 unsigned int event_len)
{
  struct nrf7002_priv *priv = os_vif_ctx;

  (void)event;
  (void)event_len;

  if (priv == NULL)
    {
      return;
    }

  syslog(LOG_WARNING, "nrf7002: disassoc from AP — carrier OFF\n");

  priv->carrier_up = false;
  priv->keys_installed = 0;
  priv->state      = NRF7002_STATE_IDLE;
  netdev_carrier_off(&priv->netdev);
}

static struct nrf_wifi_fmac_callbk_fns g_nrf7002_callbk_fns =
{
  .scan_done_callbk_fn         = nrf7002_scan_done_cb,
  .scan_res_callbk_fn          = nrf7002_scan_res_cb,
  .disp_scan_res_callbk_fn     = nrf7002_disp_scan_res_cb,
  .if_carr_state_chg_callbk_fn = nrf7002_if_carr_state_chg_cb,
  .rx_frm_callbk_fn            = nrf7002_rx_frm_cb,
  .auth_resp_callbk_fn         = nrf7002_auth_resp_cb,
  .assoc_resp_callbk_fn        = nrf7002_assoc_resp_cb,
  .deauth_callbk_fn            = nrf7002_deauth_cb,
  .disassoc_callbk_fn          = nrf7002_disassoc_cb,
  .process_rssi_from_rx        = nrf7002_process_rssi_cb,
};

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: nrf7002_initialize
 *
 * Description:
 *   Full driver initialization sequence:
 *
 *   1. Register NuttX OSAL ops with the NCS firmware stack
 *   2. Initialize FMAC layer (HAL + BAL + OSAL internal state)
 *   3. Power-up the RPU and add the QSPI device
 *   4. Download RPU firmware and bring up the interface
 *   5. Add a STA VIF
 *   6. Register the NuttX network device
 *
 * Returned Value:
 *   OK on success; negated errno on failure.
 *
 ****************************************************************************/

int nrf7002_initialize(void)
{
  struct nrf7002_priv    *priv = &g_nrf7002_priv;
  FAR struct qspi_dev_s  *saved_qspi_dev;
  int                     ret;

  /* Save the QSPI bus handle set by the board-level code (nrf53_nrf7002.c)
   * before clearing the struct.  The board code sets qspi_ctx.qspi_dev via
   *   g_nrf7002_priv.qspi_ctx.qspi_dev = nrf53_qspi_initialize(0);
   * before calling nrf7002_initialize().  The memset below would clear it,
   * causing all subsequent QSPI accesses to see a NULL pointer.
   */

  saved_qspi_dev = priv->qspi_ctx.qspi_dev;

  memset(priv, 0, sizeof(*priv));

  /* Restore the QSPI handle so nrf7002_qspi_bus_init (called back by the
   * FMAC during nrf_wifi_sys_fmac_init) finds a valid bus pointer.
   */

  priv->qspi_ctx.qspi_dev = saved_qspi_dev;

  nxmutex_init(&priv->lock);
  nxsem_init(&priv->scan_sem, 0, 0);
  nxsem_init(&priv->auth_sem,  0, 0);
  nxsem_init(&priv->assoc_sem, 0, 0);
  priv->auth_failed   = false;
  priv->rx_queue_head = NULL;
  priv->rx_queue_tail = NULL;

  /* Phase 3: Initialize TX tokens semaphore.
   * NRF7002_TX_TOKENS = 2 means at most 2 frames can be in-flight
   * simultaneously toward the RPU.
   */

  nxsem_init(&priv->tx_tokens, 0, NRF7002_TX_TOKENS);

  priv->state     = NRF7002_STATE_UNINIT;
  priv->last_rssi = -127;

  /* Step 1: Register OSAL ops.
   * This must happen before any other nrf_wifi_* call.
   */

