mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
  nrf_wifi_osal_init(&nrf7002_osal_ops);
  syslog(LOG_INFO, "nrf7002: OSAL registered\n");

  /* Step 2: Initialize FMAC.
   * Mirror the Zephyr nrf_wifi data configuration.  Leaving these fields at
   * zero lets host TX commands queue locally, but the RPU data/TX side is not
   * configured the same way as the reference driver and never completes TX.
   */

  memset(&g_data_config, 0, sizeof(g_data_config));
  g_data_config.rate_protection_type     = 0;
  g_data_config.aggregation              = NRF_WIFI_FEATURE_ENABLE;
  g_data_config.wmm                      = NRF_WIFI_FEATURE_ENABLE;
  g_data_config.max_num_tx_agg_sessions  = NRF7002_MAX_TX_AGG_SESSIONS;
  g_data_config.max_num_rx_agg_sessions  = NRF7002_MAX_RX_AGG_SESSIONS;
  g_data_config.max_tx_aggregation       = NRF7002_MAX_TX_AGGREGATION;
  g_data_config.reorder_buf_size         = NRF7002_RX_REORDER_BUF_SIZE;
  g_data_config.max_rxampdu_size         = MAX_RX_AMPDU_SIZE_64KB;

  priv->fmac_priv = nrf_wifi_sys_fmac_init(&g_data_config,
                                             g_rx_buf_pools,
                                             &g_nrf7002_callbk_fns);
  if (priv->fmac_priv == NULL)
    {
      syslog(LOG_ERR, "nrf7002: nrf_wifi_sys_fmac_init failed\n");
      ret = -ENOMEM;
      goto err_osal;
    }

  syslog(LOG_INFO, "nrf7002: FMAC initialized\n");

#ifdef NRF70_DATA_TX
  {
    struct nrf_wifi_sys_fmac_priv *sys_fpriv;

    sys_fpriv = wifi_fmac_priv(priv->fmac_priv);
    sys_fpriv->max_ampdu_len_per_token =
      (RPU_PKTRAM_SIZE - (NRF70_RX_NUM_BUFS * NRF70_RX_MAX_DATA_SIZE)) /
      NRF70_MAX_TX_TOKENS;
    sys_fpriv->max_ampdu_len_per_token &= ~0x3u;
    sys_fpriv->avail_ampdu_len_per_token =
      sys_fpriv->max_ampdu_len_per_token -
      (NRF7002_MAX_PKT_RAM_TX_ALIGN_OVERHEAD *
       g_data_config.max_tx_aggregation);

    syslog(LOG_INFO,
           "nrf7002: TX PKTRAM token=%u avail=%u agg=%u\n",
           sys_fpriv->max_ampdu_len_per_token,
           sys_fpriv->avail_ampdu_len_per_token,
           g_data_config.max_tx_aggregation);
  }
#endif

  /* Step 3: Add RPU device.
   * The FMAC will call bus_qspi_dev_add which binds the QSPI handle.
   * The qspi_dev pointer must be set in priv->qspi_ctx before this call
   * by the board-level bringup code (nrf53_nrf7002.c).
   */

  priv->fmac_dev_ctx = nrf_wifi_sys_fmac_dev_add(priv->fmac_priv, priv);
  if (priv->fmac_dev_ctx == NULL)
    {
      syslog(LOG_ERR, "nrf7002: nrf_wifi_fmac_dev_add failed\n");
      ret = -ENODEV;
      goto err_fmac;
    }

  syslog(LOG_INFO, "nrf7002: RPU device added\n");

  /* Step 3b: Parse and download the RPU firmware patch blob.
   *
   * The nRF7002 RPU contains a base ROM firmware; the blob loaded here
   * patches the LMAC and UMAC.  Without this step fmac_dev_init fails
   * because the RPU cannot respond to commands.
   *
   * This matches the Zephyr flow in:
   *   zephyr/drivers/wifi/nrf_wifi/src/fmac_main.c (nrf_wifi_fw_load)
   */

  {
    struct nrf_wifi_fmac_fw_info fw_info;

    memset(&fw_info, 0, sizeof(fw_info));

    ret = nrf_wifi_fmac_fw_parse(priv->fmac_dev_ctx,
                                  g_nrf70_fw_patch,
                                  g_nrf70_fw_patch_len,
                                  &fw_info);
    if (ret != NRF_WIFI_STATUS_SUCCESS)
      {
        syslog(LOG_ERR, "nrf7002: nrf_wifi_fmac_fw_parse failed: %d\n", ret);
        /* Continue — let dev_init report the error rather than aborting */
      }
    else
      {
        ret = nrf_wifi_fmac_fw_load(priv->fmac_dev_ctx, &fw_info);
        if (ret != NRF_WIFI_STATUS_SUCCESS)
          {
            syslog(LOG_ERR,
                   "nrf7002: nrf_wifi_fmac_fw_load failed: %d\n", ret);
          }
        else
          {
            syslog(LOG_INFO, "nrf7002: RPU firmware blob loaded (%u bytes)\n",
                   g_nrf70_fw_patch_len);
          }
      }
  }

  /* Step 4: Initialize RPU (brings up UMAC/LMAC using the loaded firmware).
   *
   * All fields in these structs are 0 (all-bands backoff disabled, all
   * gains 0 dBi, all PCB losses 0 dB) — correct for the nRF7002-DK
   * reference design.  Passing NRF_WIFI_DEF_PHY_CALIB enables the full
   * RF calibration sequence including 2.4 GHz RX/TX DC and IQ.
   */

  struct nrf_wifi_tx_pwr_ctrl_params tx_pwr_ctrl;
  struct nrf_wifi_tx_pwr_ceil_params tx_pwr_ceil;
  struct nrf_wifi_board_params       board_params;

  memset(&tx_pwr_ctrl,  0, sizeof(tx_pwr_ctrl));
  memset(&tx_pwr_ceil,  0, sizeof(tx_pwr_ceil));
  memset(&board_params, 0, sizeof(board_params));

  ret = nrf_wifi_sys_fmac_dev_init(priv->fmac_dev_ctx,
#if defined(NRF_WIFI_LOW_POWER)
                                  0,    /* sleep_type: disabled */
#endif
                                  NRF_WIFI_DEF_PHY_CALIB, /* full RF calib incl 2.4GHz */
                                  BAND_ALL, /* op_band: both 2.4/5GHz */
                                  false, /* beamforming: disabled */
                                  &tx_pwr_ctrl,
                                  &tx_pwr_ceil,
                                  &board_params,
                                  (unsigned char *)"CN"  /* country_code */);
  if (ret != NRF_WIFI_STATUS_SUCCESS)
    {
      syslog(LOG_WARNING,
             "nrf7002: nrf_wifi_sys_fmac_dev_init failed: %d "
             "(QSPI/RPU not responding — CS pin conflict or hardware issue; "
             "continuing so NSH remains usable)\n", ret);
      /* Continue: register the netdev stub so ifconfig/iwlist don't crash.
       * WiFi operations will fail until the QSPI CS pin conflict is resolved.
       */
    }
  else
    {
      syslog(LOG_INFO, "nrf7002: RPU firmware initialized\n");
    }

  /* Step 5: Add a STA VIF */

  {
    struct nrf_wifi_umac_add_vif_info vif_info;

    memset(&vif_info, 0, sizeof(vif_info));
    vif_info.iftype = NRF_WIFI_IFTYPE_STATION;

    priv->vif_idx = nrf_wifi_sys_fmac_add_vif(priv->fmac_dev_ctx,
                                               priv,
                                               &vif_info);
    if (priv->vif_idx == 0xff)
      {
        syslog(LOG_WARNING, "nrf7002: nrf_wifi_sys_fmac_add_vif failed "
               "(continuing without VIF)\n");
      }
    else
      {
        syslog(LOG_INFO, "nrf7002: VIF %u added\n", priv->vif_idx);
      }
  }

