mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_driver.c
  /* Step 5b: Read hardware MAC from OTP and update netdev d_mac.
   * The nRF7002 chip has its own OTP-programmed MAC.  NuttX must
   * use that same MAC for Ethernet frames so the AP accepts data.
   */

  {
    unsigned char otp_mac[NRF7002_MAC_ADDR_LEN];
    enum nrf_wifi_status mac_status;

    memset(otp_mac, 0, sizeof(otp_mac));
    mac_status = nrf_wifi_fmac_otp_mac_addr_get(priv->fmac_dev_ctx,
                                                 priv->vif_idx,
                                                 otp_mac);
    if (mac_status == NRF_WIFI_STATUS_SUCCESS &&
        (otp_mac[0] | otp_mac[1] | otp_mac[2] |
         otp_mac[3] | otp_mac[4] | otp_mac[5]) != 0)
      {
        memcpy(priv->mac_addr, otp_mac, NRF7002_MAC_ADDR_LEN);
        syslog(LOG_INFO,
               "nrf7002: OTP MAC %02x:%02x:%02x:%02x:%02x:%02x\n",
               otp_mac[0], otp_mac[1], otp_mac[2],
               otp_mac[3], otp_mac[4], otp_mac[5]);

        /* Program the OTP MAC into the RPU VIF so the firmware uses it
         * for OTA 802.11 frames.  Must match what NuttX puts in d_mac.
         */

        mac_status = nrf_wifi_sys_fmac_set_vif_macaddr(priv->fmac_dev_ctx,
                                                        priv->vif_idx,
                                                        otp_mac);
        if (mac_status != NRF_WIFI_STATUS_SUCCESS)
          {
            syslog(LOG_WARNING,
                   "nrf7002: set_vif_macaddr failed (%d)\n",
                   (int)mac_status);
          }
      }
    else
      {
        syslog(LOG_WARNING,
               "nrf7002: OTP MAC read failed (%d), using default\n",
               (int)mac_status);
      }
  }

  /* Step 6: Register NuttX network device */

  ret = nrf7002_netdev_register(priv);
  if (ret < 0)
    {
      syslog(LOG_ERR, "nrf7002: netdev_register failed: %d\n", ret);
      goto err_vif;
    }

  priv->state = NRF7002_STATE_IDLE;
  syslog(LOG_INFO, "nrf7002: driver initialized\n");

  return OK;

err_vif:
  nrf_wifi_sys_fmac_dev_deinit(priv->fmac_dev_ctx);
  nrf_wifi_fmac_dev_rem(priv->fmac_dev_ctx);

err_fmac:
  nrf_wifi_fmac_deinit(priv->fmac_priv);

err_osal:
  nxsem_destroy(&priv->tx_tokens);
  nxmutex_destroy(&priv->lock);
  nxsem_destroy(&priv->scan_sem);
  nxsem_destroy(&priv->auth_sem);
  nxsem_destroy(&priv->assoc_sem);

  return ret;
}
